Public Member Functions | List of all members
API_IDialogEventHandler Class Referenceabstract
Notifications Manager
Defining an interface for Dialog event handlers. More...
#include <APIdefs_Callback.h>
 Inheritance diagram for API_IDialogEventHandler:
 Public Member Functions
virtual  | ~API_IDialogEventHandler ()=default
virtual void  | EnableAllInfoDialog () const =0
Detailed Description
Defining an interface for Dialog event handlers.
Since
Archicad 26
Constructor & Destructor Documentation
◆ ~API_IDialogEventHandler()
 virtual API_IDialogEventHandler::~API_IDialogEventHandler  |  ( |   | )
virtualdefault
Member Function Documentation
◆ EnableAllInfoDialog()
 virtual void API_IDialogEventHandler::EnableAllInfoDialog  |  ( |   | ) |   const
pure virtual